anran2020/Kkkk/mllib/ntp/w5100/stm32f10x/ntp_w5100_stm32f10x.c
/**
******************************************************************************
* 文件:net.c
* 作者:   zzx
* 版本:   V0.01
* 日期:     2014-12-01
* 内容简介:
*
******************************************************************************
*  					文件历史
*
* 版本号-----  日期   -----   作者    ------   说明
* v0.1                       2014-12-01          zzx                 创建该文件
*
*
*
******************************************************************************
**/

//----------------------------------------------------------------------------
//文件条件编译
//----------------------------------------------------------------------------


#if (1)


//----------------------------------------------------------------------------
//includes
//----------------------------------------------------------------------------  
#include "mlos_ltimer.h"
#include "mlos_task.h"
#include "ntp_usocket.h"
#include"ntp_w5100_def.h"
#include "ntp_def.h"

// stm 头文件
#include "stm32f10x.h"





//----------------------------------------------------------------------------
//  f103ze borad defines 
//----------------------------------------------------------------------------

#define  F103ZE_HW_OLD_VERSION  1

//----------------------------------------------------------------------------
// global variable
//----------------------------------------------------------------------------

W5100Network w5100;


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_gpio_init(void)
{

	GPIO_InitTypeDef   gpio;
	
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOC 
						 | RCC_APB2Periph_GPIOD| RCC_APB2Periph_GPIOE|RCC_APB2Periph_GPIOF
						 |RCC_APB2Periph_GPIOG, ENABLE);

	//gpio init
#if F103ZE_HW_OLD_VERSION	
	//w5100 reset pin
	gpio.GPIO_Pin = GPIO_Pin_1;
	gpio.GPIO_Mode = GPIO_Mode_Out_PP;
	gpio.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOE, &gpio); 

	GPIO_SetBits(GPIOE, GPIO_Pin_1);

	//w5100 link pin
	gpio.GPIO_Pin = GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	gpio.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOG, &gpio);
#else

	//w5100 reset pin
	gpio.GPIO_Pin = GPIO_Pin_9;
	gpio.GPIO_Mode = GPIO_Mode_Out_PP;
	gpio.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &gpio); 

	GPIO_SetBits(GPIOC, GPIO_Pin_9);

	//w5100 link pin
	gpio.GPIO_Pin = GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	gpio.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOG, &gpio); 

#endif

	//fmsc init

	//数据线配置
//	gpio.GPIO_Pin = 	GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_9 |
//									GPIO_Pin_10 | GPIO_Pin_14 | GPIO_Pin_15;
	
	gpio.GPIO_Pin = 	GPIO_Pin_0 | GPIO_Pin_1 |  GPIO_Pin_14 | GPIO_Pin_15;
	gpio.GPIO_Mode = GPIO_Mode_AF_PP;
	gpio.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_Init(GPIOD, &gpio);

//	gpio.GPIO_Pin = 	GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 |
//									GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	
	gpio.GPIO_Pin = 	GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 ;
	GPIO_Init(GPIOE, &gpio);

	//地址线配置
	gpio.GPIO_Pin = 	GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | 
									GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_12 | GPIO_Pin_13 | 
									GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_Init(GPIOF, &gpio);

	gpio.GPIO_Pin = 	GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | 
									GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_Init(GPIOG, &gpio);

	//NOE : 读使能信号低电平有效  NWE : 写使能信号低电平有效
	gpio.GPIO_Pin = GPIO_Pin_4 |GPIO_Pin_5;
	GPIO_Init(GPIOD, &gpio);

	//  NE3  block 3 片选信号
	gpio.GPIO_Pin = GPIO_Pin_10; 
	GPIO_Init(GPIOG, &gpio);

}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
_inline void w5100_reset_pin_l(void)
{
#ifdef F103ZE_HW_OLD_VERSION
	GPIOE->BRR=GPIO_Pin_1;
#else
	GPIOC->BRR=GPIO_Pin_9;
#endif

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
_inline void w5100_reset_pin_h(void)
{
#ifdef F103ZE_HW_OLD_VERSION
	GPIOE->BSRR=GPIO_Pin_1;
#else
	GPIOC->BSRR=GPIO_Pin_9;
#endif

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_fsmc_init(void)
{
	FSMC_NORSRAMInitTypeDef  fsmc;
	FSMC_NORSRAMTimingInitTypeDef  norSramTiming;

	//fsmc clock
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_FSMC | RCC_AHBPeriph_SRAM, ENABLE);
		
	//
	norSramTiming.FSMC_AddressSetupTime = 1;
	norSramTiming.FSMC_AddressHoldTime = 1;
	norSramTiming.FSMC_DataSetupTime = 2;
	norSramTiming.FSMC_BusTurnAroundDuration = 0;
	norSramTiming.FSMC_CLKDivision = 0;
	norSramTiming.FSMC_DataLatency = 0;
	norSramTiming.FSMC_AccessMode = FSMC_AccessMode_A;

	//bank 选择
	fsmc.FSMC_Bank = FSMC_Bank1_NORSRAM3;
	//
	fsmc.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
	fsmc.FSMC_MemoryType = FSMC_MemoryType_SRAM;
	fsmc.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_8b;
	fsmc.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
	fsmc.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
	fsmc.FSMC_WrapMode = FSMC_WrapMode_Disable;
	fsmc.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
	fsmc.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
	fsmc.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
	fsmc.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
	//等待数据同步
	fsmc.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;
	fsmc.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
	fsmc.FSMC_ReadWriteTimingStruct = &norSramTiming;
	fsmc.FSMC_WriteTimingStruct = &norSramTiming;

	FSMC_NORSRAMInit(&fsmc); 

