anran2020/Kkkk/mllib/ntp/w5100/stm32f10x/ntp_w5100_stm32f10x.c
	/* Enable FSMC Bank1_SRAM Bank */
	FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM3, ENABLE);

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_swt_isr(void)
{
	
	unsigned char *ptr,regVal;	
	
	//读取s0 中断寄存器，查询sndok bit
	//
	//回写清中断标志

	//读取中断标识
	ptr=( unsigned char*)W5100_IR;
	regVal=*ptr;
	*ptr=regVal;

	//s1 tcp 只监测tcp 中断管脚长时间低电平
	ptr=( unsigned char*)W5100_S0_IR;
	regVal=*ptr;
	*ptr=regVal;
						

}



//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
unsigned int w5100_socket_rx(USockptr pusck)
{
	unsigned char *ptr;
	unsigned int i,rx_size,rx_offset;

	//读取接收数据的字节数
	ptr=(unsigned char*)(W5100_S0_RX_RSR+pusck->sn*0x100);
	rx_size=*ptr;
	ptr++;
	rx_size=(rx_size<<8);
	rx_size+=*ptr;

	//读取接收缓冲区的偏移量
	ptr=(unsigned char*)(W5100_S0_RX_RR+pusck->sn*0x100);
	rx_offset=*ptr;
	ptr++;
	rx_offset=(rx_offset<<8);
	rx_offset+=*ptr;

	//计算实际的物理偏移量，S_RX_SIZE需要在前面#define中定义
	//S_RX_SIZE的值在W5100_Init()函数的W5100_RMSR中确定
	i=rx_offset/S_RX_SIZE;
	rx_offset=rx_offset-i*S_RX_SIZE;

	//实际物理地址为W5100_RX+rx_offset
	//将数据缓存到Rx_buffer数组中
	ptr=(unsigned char*)(W5100_RX+pusck->sn*S_RX_SIZE+rx_offset);
	for(i=0;i<rx_size;i++)
	{
		if(rx_offset>=S_RX_SIZE)
		{
			ptr=(unsigned char*)(W5100_RX+pusck->sn*S_RX_SIZE);
			rx_offset=0;
		}
		pusck->pRxBuf[i]=*ptr;
		ptr++;
		rx_offset++;
	}

	//计算下一次偏移量
	ptr=(unsigned char*)(W5100_S0_RX_RR+pusck->sn*0x100);
	rx_offset=*ptr;
	ptr++;
	rx_offset=(rx_offset<<8);
	rx_offset+=*ptr;
	
	rx_offset=rx_offset+rx_size;
	ptr=(unsigned char*)(W5100_S0_RX_RR+pusck->sn*0x100);
	*ptr=(rx_offset>>8);
	ptr++;
	*ptr=rx_offset;

	//设置RECV命令，等下一次接收
	ptr=(unsigned char*)(W5100_S0_CR+pusck->sn*0x100);
	*ptr=S_CR_RECV;

	//返回接收数据的字节数
	pusck->rxDataLen+=rx_size;
	return rx_size;
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
unsigned int w5100_socket_tx(USockptr pusck)
{
	unsigned char *ptr;
	unsigned int i;
	unsigned int txFreeSize,txOffset;

	//如果是UDP模式,可以在此设置目的主机的IP和端口号
	if(pusck->mode==S_MR_UDP)
	{
		//socket 1 
			ptr=(unsigned char*)(W5100_S0_DIPR+pusck->sn*0x100);
			for(i=0;i<4;i++){
				*ptr=pusck->remoteip[i];
				ptr++;
			}
			ptr=(unsigned char*)(W5100_S0_DPORT+pusck->sn*0x100);
			*ptr=(pusck->remoteport>>8);
			ptr++;
			*ptr=pusck->remoteport;

	}

	//读取缓冲区剩余的长度
	//如果剩余的字节长度小于发送字节长度,则返回
	ptr=(unsigned char*)(W5100_S0_TX_FSR+pusck->sn*0x100);
	txFreeSize=*ptr;
	txFreeSize=(txFreeSize<<8);
	ptr++;
	txFreeSize+=(*ptr);
	if(txFreeSize<pusck->txDataLen)
		return 0;

	ptr=(unsigned char*)(W5100_S0_TX_WR+pusck->sn*0x100);
	txOffset=*ptr;
	txOffset=(txOffset<<8);
	ptr++;
	txOffset+=(*ptr);

	//计算实际的物理偏移量
	i=txOffset/S_TX_SIZE;
	txOffset=txOffset-i*S_TX_SIZE;

	//实际物理地址为W5100_TX+txOffset
	//将Tx_buffer缓冲区中的数据写入到发送缓冲区
	ptr=(unsigned char*)(W5100_TX+pusck->sn*S_TX_SIZE+txOffset);
	for(i=0;i<pusck->txDataLen;i++)
	{
		if(txOffset>=S_TX_SIZE)
		{
			ptr=(unsigned char*)(W5100_TX+pusck->sn*S_TX_SIZE);
			txOffset=0;
		}
		*ptr=pusck->pTxBuf[i];
		ptr++;
		txOffset++;
	}

	//计算下一次的偏移量
	ptr=(unsigned char*)(W5100_S0_TX_WR+pusck->sn*0x100);
	txOffset=*ptr;
	txOffset=(txOffset<<8);
	ptr++;
	txOffset+=(*ptr);

	txOffset+=pusck->txDataLen;
	ptr=(unsigned char*)(W5100_S0_TX_WR+pusck->sn*0x100);
	*ptr=(txOffset>>8);
	ptr++;
	*ptr=txOffset;

	//设置SEND命令,启动发送
	ptr=(unsigned char*)(W5100_S0_CR+pusck->sn*0x100);
	*ptr=S_CR_SEND;

	return pusck->txDataLen;

}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_loop_back_test(void)
{
//	unsigned short size;
//	unsigned char *ptr;
		/***** First step: Read data from RX buffer and dump them in S_Buffer ****/
//		size=s_rx_process(0);
		/***** Second step: Write S_Buffer data to TX buffer and send out ****/
		/**** Wait for SendOK or TimeOut event occur***/

//		ptr=(unsigned char*)W5100_S0_CR;
//		while((socketSndOkFlag==0)&&(socketTimeOutFlag==0))
		{
//			if((*ptr)==0)	
//			{
//				socketSndOkFlag=1;
//			}
		}
//		socketSndOkFlag=0;
//		socketTimeOutFlag=0;
//		s_tx_process(0, size);	

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
unsigned char w5100_s1_udp_loop_back(void)
{
#if 0
	unsigned short i,j;
	unsigned char *ptr;
	
		/***** First step: Read data from RX buffer and dump them in S_Buffer ****/
	i=s_rx_process(1);
	
	/* Set Destination IP */
	ptr=(unsigned char*)W5100_S1_DIPR;
	*ptr++=w5100MU.rxBuf[0];
	*ptr++=w5100MU.rxBuf[1];
	*ptr++=w5100MU.rxBuf[2];
	*ptr=w5100MU.rxBuf[3];
	
	/* Set Destination Port Number */
	ptr=(unsigned char*)W5100_S1_DPORT;
	*ptr++=w5100MU.rxBuf[4];
	*ptr=w5100MU.rxBuf[5];
	
	/* Adjust TX data size */
	i-=8;
	
	/* Move RX_Buffer data to TX_Buffer */
	for(j=0;j<i;j++)
		w5100MU.rxBuf[j]=w5100MU.rxBuf[j+8];
	
