anran2020/Kkkk/mllib/ntp/w5100/stm32f10x/ntp_w5100_stm32f10x.c
	/***** Second step: Write S_Buffer data to TX buffer and send out ****/
	/**** Wait for SendOK or TimeOut event occur***/
	ptr=(unsigned char*)W5100_S1_CR;
	while((*ptr)!=0);

//	s_tx_process(1, i);	
#endif
	return 1;
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_ir_handler(void)
{
	//u8 i,snINT;
	volatile unsigned char irReg,snIRReg;
	volatile unsigned char *ptr;
	

	//读取中断标识
	ptr=(unsigned char*)W5100_IR;
	irReg=*ptr;

	//回写清中断标志
	*ptr=(irReg&0xf0);

	//IP地址冲突异常处理
	if((irReg&IR_CONFLICT)==IR_CONFLICT)
	{
	//		led_01_on();
	}
	// udp 模式下无法到达，异常处理
	if((irReg&IR_UNREACH)==IR_UNREACH)
	{
	//		led_02_on();
	}
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
u8 w5100_reset(void)
{
	subtask_declaration();//任务声明
	unsigned char* u8ptr;
	
	subtask_begin(w5100.pMyDriveTask);//任务开始

	//hw reset
	w5100_reset_pin_l();
	//delya 2ms
	subtask_ms_delay(w5100.pMyDriveTask, 20, TASK_NONBLOCKING_YIELD);
	w5100_reset_pin_h();
	//delya 50ms
	subtask_ms_delay(w5100.pMyDriveTask, 100, TASK_NONBLOCKING_YIELD);
	//软复位W5100
	u8ptr=(unsigned char*)W5100_MODE;
	*u8ptr=MODE_RST;
	//delya 100ms
	subtask_ms_delay(w5100.pMyDriveTask, 100, TASK_NONBLOCKING_YIELD);

	//进入 餐设置
	w5100.sta=e_network_setting;
	subtask_end(w5100.pMyDriveTask, TASK_ENDED);
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_setting(void)
{
	unsigned char* ptr;
	mlu16 i;
	
	//	设置网关(Gateway)的IP地址，4字节
	//	使用网关可以使通信突破子网的局限，
	// 通过网关可以访问到其它子网或进入Internet
	ptr=(unsigned char*)W5100_GAR;
	for(i=0;i<4;i++)
	{
		*ptr=w5100.gateway[i];
		ptr++;
	}

	ptr=(unsigned char*)W5100_GAR;
	for(i=0;i<4;i++)
	{
		w5100.gateway[i]=*ptr;
		ptr++;
	}
    
	//设置子网掩码(MASK)值，4字节。子网掩码用于子网运算
	ptr=(unsigned char*)W5100_SUBR;
	for(i=0;i<4;i++)
	{
		*ptr=w5100.subnetmask[i];
		ptr++;
	}
	ptr=(unsigned char*)W5100_SUBR;
	for(i=0;i<4;i++)
	{
		w5100.subnetmask[i]=*ptr;
		ptr++;
	}
    
	//	设置物理地址，6字节，用于唯一标识网络设备的物理地址值
	//	该地址值需要到IEEE申请，按照OUI的规定，前3个字节为厂商代码，后三个字节为产品序号
	//	如果自己定义物理地址，注意第一个字节必须为偶数
	ptr=(unsigned char*)W5100_SHAR;
	for(i=0;i<6;i++)
	{
		*ptr=w5100.mac[i];
		ptr++;
	}
	ptr=(unsigned char*)W5100_SHAR;
	for(i=0;i<6;i++)
	{
		w5100.mac[i]=*ptr;
		ptr++;
	}
	//	设置本机的IP地址，4个字节
	//	注意，网关IP必须与本机IP属于同一个子网，否则本机将无法找到网关
	ptr=(unsigned char*)W5100_SIPR;
	for(i=0;i<4;i++)
	{
		*ptr=w5100.ip[i];
		ptr++;
	}
	ptr=(unsigned char*)W5100_SIPR;
	for(i=0;i<4;i++)
	{
		w5100.ip[i]=*ptr;/*sys.attributeMU.myIP为4字节unsigned char数组,自己定义*/
		ptr++;
	}
	
	//设置发送缓冲区和接收缓冲区的大小，参考W5100数据手册
	//Socket Rx memory size  2k 
	ptr=(unsigned char*)W5100_RMSR;
	*ptr=0x55;
	//Socket Tx mempry size  2k
	ptr=(unsigned char*)W5100_TMSR;
	*ptr=0x55;

	///* 启动中断，参考W5100数据手册确定自己需要的中断类型
	//IMR_CONFLICT是IP地址冲突异常中断
	//IMR_UNREACH是UDP通信时，地址无法到达的异常中断
	//其它是Socket事件中断，根据需要添加 */
	ptr=(unsigned char*)W5100_IMR;
	*ptr=(IMR_CONFLICT|IMR_S0_INT|IMR_S1_INT);
	
	//
	w5100.sta=e_network_working;
	return 0;	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_working(void)
{
	
	//查询中断，处理中断
	w5100_ir_handler();

	return 0;
}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_unlinked(void)
{

	return 1;

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_fsm_run(void)
{
	//
	switch (w5100.sta)
	{
		case e_network_reset:
			w5100_reset();
			break;
		
		case e_network_setting:
			w5100_setting();
			break;

		case e_network_working:
			w5100_working();
			break;

		case e_network_PHYUnlinked:
			w5100_unlinked();
			break;
	}
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void w5100_usocket_isr(USockptr pusck)
{
	mlu8 snIRReg;
	unsigned char* ptr;

	//回写清中断标志
	//W5100_S0_IR
	ptr=(unsigned char*)(W5100_S0_IR+pusck->sn*0x100);
	snIRReg=*ptr;
	*ptr=snIRReg;
	
	//在TCP模式下,Socket0成功连接
	if(snIRReg&S_IR_CON)
	{
		pusck->connSta=e_sck_cnn_established;
	}
	
	//在TCP模式下Socke0t断开连接处理，自己添加代码
	if(snIRReg&S_IR_DISCON)
	{	
		//关闭端口，等待重新打开连接
		pusck->connSta=e_sck_cnn_closed;
	
	}
	
	//Socket0数据发送完成，可以再次启动S_tx_process()函数发送数据
	if(snIRReg&S_IR_SENDOK)
	{			
		pusck->txsta=e_sck_txFinished;
	}
	
	//Socket0接收到数据，可以启动S_rx_process()函数
	if(snIRReg&S_IR_RECV)
	{			
		pusck->rxsta=e_sck_rxData;
	
