anran2020/Kkkk/mllib/ntp/w5100/stm32f10x/ntp_w5100_stm32f10x.c
	}
	
	//Socket0连接或数据传输超时处理
	if(snIRReg&S_IR_TIMEOUT)
	{
		//关闭端口，等待重新打开连接
		//ptr=(unsigned char*)W5100_S0_CR;
		//*ptr=S_CR_CLOSE;
		
		pusck->timeOut=1;
		
	}

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	  :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_usocket_open(USockptr pusck)
{
	subtask_declaration();//任务声明
	mlu8 regval,i;
	unsigned char* ptr;

	subtask_begin(pusck->pMyDriveTask);//任务开始

	//设置模式
	if(pusck->mode==S_MR_TCP)
	{
		// 设置Socket为TCP模式
		//为了提高响应速度，将ND/MC位置位 
		ptr=(unsigned char*)(W5100_S0_MR+pusck->sn*0x100);
		*ptr=(S_MR_TCP|S_MR_MC);
	}
	else{
		//设置Socket为UDP模式
		ptr=(unsigned char*)(W5100_S0_MR+pusck->sn*0x100);
		*ptr=S_MR_UDP;
		pusck->haveUDPHead=1;//有udp协议包头
	}
	
	//设置本机source的端口号
	ptr=(unsigned char*)(W5100_S0_PORT+pusck->sn*0x100);
	*ptr= (pusck->myport>>8);
	ptr++;
	*ptr=pusck->myport;

	
	//tcp 需要建立连接
	if(pusck->mode==S_MR_TCP)
	{
		//设置远程主机IP地址，即服务器的IP地址
		ptr=(unsigned char*)(W5100_S0_DIPR+pusck->sn*0x100);
		for(i=0;i<4;i++)
		{
			*ptr=pusck->remoteip[i];
			ptr++;
		}
		//Socket的目的端口号为
		ptr=(unsigned char*)(W5100_S0_DPORT+pusck->sn*0x100);
		*ptr=(pusck->remoteport>>8);
		ptr++;
		*ptr=pusck->remoteport;

	}
	
	//打开Socket
	ptr=(unsigned char*)(W5100_S0_CR+pusck->sn*0x100);
	*ptr=S_CR_OPEN;

	subtask_ms_delay(pusck->pMyDriveTask,50, TASK_BLOCKING_YIELD);

	//打开不成功，关闭Socket，然后返回
	ptr=(unsigned char*)(W5100_S0_SSR+pusck->sn*0x100);
	regval=*ptr;
	if((pusck->mode==S_MR_TCP&&regval==S_SSR_INIT)||
		(pusck->mode==S_MR_UDP&&regval==S_SSR_UDP))
	{
	
		//soc打开成功
		pusck->txsta=e_sck_txFinished;
		pusck->timeOut=0;
		pusck->rxsta=e_sck_rxNull;
		pusck->txDataLen=0;
		pusck->rxDataLen=0;
		pusck->connSta=e_sck_cnn_none;
		pusck->rxTimeoutCnt=0;
		if(pusck->mode==S_MR_TCP)
		{
			pusck->sta=e_sck_sta_connecting;
		}
		else
		{
			pusck->sta=e_sck_sta_working;
		}
		
	}
	else
	{
			pusck->sta=e_sck_sta_closed;
	}

	subtask_end(pusck->pMyDriveTask, TASK_ENDED);//任务结束
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	  :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_usocket_connect(USockptr pusck)
{
	subtask_declaration();//任务声明
	mlu8 regval;
	unsigned char* ptr;


	subtask_begin(pusck->pMyDriveTask);//任务开始

	//设置Socket为Connect模式
	ptr=(unsigned char*)(W5100_S0_CR+pusck->sn*0x100);
	*ptr=S_CR_CONNECT;

	subtask_ms_delay(pusck->pMyDriveTask,200, TASK_BLOCKING_YIELD);
	ptr=(unsigned char*)(W5100_S0_SSR+pusck->sn*0x100);
	regval=*ptr;
	if(regval==S_SSR_ESTABLISHED)
	{
		//建立连接,进入工作状态
		pusck->connSta=e_sck_cnn_established;
		pusck->sta=e_sck_sta_working;
	}
	else
	{	 
		//连接超时
			pusck->connSta=e_sck_cnn_failed;
			pusck->sta=e_sck_sta_closed;

	}

	subtask_end(pusck->pMyDriveTask, TASK_ENDED);//任务结束

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	  :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_usocket_close(USockptr pusck)
{
	
	subtask_declaration();//任务声明
	mlu8 regVal;
	unsigned char* ptr;

	subtask_begin(pusck->pMyDriveTask);//任务开始

	//close
	ptr=(unsigned char*)(W5100_S0_SSR+pusck->sn*0x100);
	if(*ptr!=S_SSR_CLOSED)
	{
		//关闭socket s
		ptr=(unsigned char*)(W5100_S0_CR+pusck->sn*0x100);
		*ptr=S_CR_CLOSE;
	}

	subtask_ms_delay(pusck->pMyDriveTask,500, TASK_NONBLOCKING_YIELD);
	ptr=(unsigned char*)(W5100_S0_SSR+pusck->sn*0x100);
	if(*ptr!=S_SSR_CLOSED)
	{
		w5100.sta=e_network_reset;//复位网络模块
	}
	else
	{
			//启动重连
			pusck->sta=e_sck_sta_opening;
	}
		
	//清除所有中断标识
	//回写清中断标志
	ptr=(unsigned char*)(W5100_S0_IR+pusck->sn*0x100);
	regVal=*ptr;
	*ptr=regVal;


	//延时2000ms
	subtask_ms_delay(pusck->pMyDriveTask,2000, TASK_NONBLOCKING_YIELD);


	subtask_end(pusck->pMyDriveTask, TASK_ENDED);//任务结束

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	  :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
int w5100_usocket_work(USockptr pusck)
{
//	unsigned char *ptr;
	//unsigned char i,reg;
#if 1

	//状态检测
	w5100_usocket_isr(pusck);


	//接收数据
	if (pusck->rxsta==e_sck_rxData&&w5100_socket_rx(pusck))
	{
		pusck->rxsta=e_sck_rxNull;
		pusck->rxTimeoutCnt=0;
		//lbtimer_load_start(pusck->rxtimer,1000);
	}

	//发送数据
	if (pusck->txDataLen>0&&w5100_socket_tx(pusck))
	{
		pusck->txDataLen=0;
	}

	//发送超时
	//if()
	{

	}
	
	//
	if(pusck->connSta==e_sck_cnn_closed||pusck->timeOut==_set)
	{
		pusck->txDataLen=0;
		pusck->txDataLen=0;
		pusck->sta=e_sck_sta_closed;
	}
	return 1;
#endif
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void ntp_usocket_drive(USockptr pusck )
{

	//模块状态机
	w5100_fsm_run();


	//检查网络硬件模块是否在工作
	if (w5100.sta!=e_network_working)
	{
		return;
	}
	
	//socket状态机
	switch (pusck->sta)
	{
		case e_sck_sta_opening://打开网络套接字
			w5100_usocket_open(pusck);
		break;
		case e_sck_sta_connecting://建立连接
			w5100_usocket_connect(pusck);
		break;
		case e_sck_sta_working://工作
			w5100_usocket_work(pusck);
		break;
		case e_sck_sta_closed://关闭状态
			w5100_usocket_close(pusck);
		break;
	}

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void ntp_network_init(mlu8* ip,mlu8* mask,mlu8* gateway,mlu8* mac)
{
	mlu8 i;
	
	//初始化 mcu 外设
	w5100_gpio_init();
	w5100_fsmc_init();

	//初始化状态复位
	w5100.sta=e_network_reset;
	for (i = 0; i < 4; ++i)
	{
		w5100.ip[i]=ip[i];
		w5100.subnetmask[i]=mask[i];
		w5100.gateway[i]=gateway[i];
		w5100.mac[i]=mac[i];
	}
	w5100.mac[i]=mac[i];
	++i;
	w5100.mac[i]=mac[i];

	//创建驱动任务
	w5100.pMyDriveTask=subtask_create(ltimer_create());
	
}

//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------
#endif

